# Pandas

pandas is a software package written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating tabular data and time series.

## Learning objective

We will use an example from a real research project and use pandas to walk through steps that social scientists usually take to handle raw data.

## 1. Import pandas

To begin, let's look at a few ways to import pandas

In [1]:
# import specific classes and functions: useful if you know you'll only be needing the most common parts of pandas
from pandas import DataFrame, read_csv

# General syntax to import a package but no functions: 
#   import (package) as (give the package a nickname/alias)
# Most pandas users will import the entire package and give it the short nickname "pd" as follows:
import pandas as pd

## 2. Data example

We are going to use an example dataset retrieved from Stack Overflow.

Stack Overflow is a question and answer website. Users can ask and answer questions related to programming. Here is an example question and all the answers:

https://stackoverflow.com/questions/4/how-to-convert-a-decimal-to-a-double-in-c

Stack Overflow data is publicly available, which allows researchers to observe user behavior in the community.

Here is an overview of the data schema:

https://meta.stackexchange.com/questions/2677/database-schema-documentation-for-the-public-data-dump-and-sede

Stack Overflow data is commonly used in social science research, especially studies about expertise and knowledge sharing! Here are just a few examples:
- [How do programmers ask and answer questions on the web?](https://dl.acm.org/doi/abs/10.1145/1985793.1985907)
- [Discovering Value from Community Activity on Focused Question Answering Sites: A Case Study of Stack Overflow](https://dl.acm.org/doi/abs/10.1145/2339530.2339665)

## 3. Import csv data

As mentioned in the introduction, pandas is designed to work with tabular data. Tabluar data is most commonly provided to researchers in a simple spreadsheet format known as csv, which stands for *comma separated values*. Because of this, pandas has a function to load tabular data from a csv file:  `read_csv`. Let us take a look at this function and what inputs it takes.

In [ ]:
help(read_csv)

Common parameters in **read_csv**

read_csv(filepath, sep= , header= , usecols=None)

- filepath_or_buffer : str, path object or file-like object
   
- sep : str, default ','
    
- header : int, list of int
 - Row number(s) to use as the column names, and the start of the data.  
    
- names : array-like, optional
 - List of column names to use, if the file contains a header row
   
- usecols : list-like or callable
 - Return a subset of the columns. 
 - For example, a valid list-like
    `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.

As we can see from the parameters description, we need to give `read_csv` a path to the csv file we want to load. Here, we will load the example StackOverflow data, which is contained in the file "so_question.csv" in our GitHub repo.

In [2]:
# The following path is valid for our Binder setup. If you are running this notebook in your local machine instead and have the file downloaded to a different location, you may need to change this path.
Location = './data/so_question.csv'
df = pd.read_csv(Location)

`read_csv` loads the data into a structure known as a **DataFrame**, as we can see if we check the type of the variable `df` that we created:

In [3]:
type(df)

pandas.core.frame.DataFrame

Think of a **DataFrame** as a table or spreadsheet that you can work with inside your Python code! Like any table, it contains data organized into rows and columns.

Now you might be wondering what the data actually looks like. The best way to find out is to use the `display` function, which will show a sample of data from the DataFrame. This is always the first thing you should do after loading a new dataset in pandas!

In [4]:
display(df)

,24752851,2014-07-15 07:58:49,.htaccess,2014,7,24768174,509916
0,39926330,2016-10-07 21:55:43,.htaccess,2016,10,NaN,5281549.0
1,26762140,2014-11-05 16:26:24,.htaccess,2014,11,26762882.0,2091861.0
2,29889423,2015-04-27 07:14:00,.htaccess,2015,4,NaN,589973.0
3,10582676,2012-05-14 11:43:27,.htaccess,2012,5,NaN,1326187.0
4,24544084,2014-07-03 02:39:25,.htaccess,2014,7,NaN,1448031.0
...,...,...,...,...,...,...,...
60564,39093361,2016-08-23 05:55:50,zurb-foundation,2016,8,NaN,2729887.0
60565,37248756,2016-05-16 07:25:11,zurb-foundation-6,2016,5,37251132.0,1148107.0
60566,16264645,2013-04-28 15:50:01,zxing,2013,4,16264687.0,2102871.0
60567,30389191,2015-05-22 05:46:07,zxing,2015,5,NaN,571433.0
60568,26181174,2014-10-03 14:44:59,zxing,2014,10,NaN,1491212.0

This brings us to the first problem of the exercise. The `read_csv` function treated the first record in the csv file as the header names. This is obviously not correct since the text file did not provide us with header names; instead, we can see that the first row looks like real data.

To correct this we will pass the `header` parameter to the read_csv function and set it to **None** (means null in python).

In [5]:
df = pd.read_csv(Location, header=None)
display(df)

,0,1,2,3,4,5,6
0,24752851,2014-07-15 07:58:49,.htaccess,2014,7,24768174.0,509916.0
1,39926330,2016-10-07 21:55:43,.htaccess,2016,10,NaN,5281549.0
2,26762140,2014-11-05 16:26:24,.htaccess,2014,11,26762882.0,2091861.0
3,29889423,2015-04-27 07:14:00,.htaccess,2015,4,NaN,589973.0
4,10582676,2012-05-14 11:43:27,.htaccess,2012,5,NaN,1326187.0
...,...,...,...,...,...,...,...
60565,39093361,2016-08-23 05:55:50,zurb-foundation,2016,8,NaN,2729887.0
60566,37248756,2016-05-16 07:25:11,zurb-foundation-6,2016,5,37251132.0,1148107.0
60567,16264645,2013-04-28 15:50:01,zxing,2013,4,16264687.0,2102871.0
60568,30389191,2015-05-22 05:46:07,zxing,2015,5,NaN,571433.0
60569,26181174,2014-10-03 14:44:59,zxing,2014,10,NaN,1491212.0

We can see that all 10000 rows of the csv file are now correctly treated as real data. Since no header names were given, pandas automatically just numbers the headers starting from 0. This is obviously not very useful, usually you want your columns to have meaningful names describing what kind of data they contain. In this case, the documentation for the StackOverflow dataset tells us what the columns are: 
- The first column is an ID
- The second column is a timestamp
- The third column is a topic tag
- The fourth column is a year
- The fifth column is a month
- The sixth column is the ID of the accepted answer, if any
- The seventh column is the ID of the author

Now we want to tell pandas to use column names that are descriptive of this data. We can do this by passing a list of column names to the parameter `names`. This also lets us omit the `header` parameter.

In [6]:
df = pd.read_csv(Location, names=['id', 'creation_time', 'tag', 'year','month', 'accepted_id','owner_user_id'])
display(df)

,id,creation_time,tag,year,month,accepted_id,owner_user_id
0,24752851,2014-07-15 07:58:49,.htaccess,2014,7,24768174.0,509916.0
1,39926330,2016-10-07 21:55:43,.htaccess,2016,10,NaN,5281549.0
2,26762140,2014-11-05 16:26:24,.htaccess,2014,11,26762882.0,2091861.0
3,29889423,2015-04-27 07:14:00,.htaccess,2015,4,NaN,589973.0
4,10582676,2012-05-14 11:43:27,.htaccess,2012,5,NaN,1326187.0
...,...,...,...,...,...,...,...
60565,39093361,2016-08-23 05:55:50,zurb-foundation,2016,8,NaN,2729887.0
60566,37248756,2016-05-16 07:25:11,zurb-foundation-6,2016,5,37251132.0,1148107.0
60567,16264645,2013-04-28 15:50:01,zxing,2013,4,16264687.0,2102871.0
60568,30389191,2015-05-22 05:46:07,zxing,2015,5,NaN,571433.0
60569,26181174,2014-10-03 14:44:59,zxing,2014,10,NaN,1491212.0

Notice the leftmost column is special: it does not have a name and simply contains consecutive numbers [0,1,2,3,4,...]. This is the *index* of the DataFrame; you can think of these as the row numbers in an Excel file. This index is also similar to the primary key of a sql table with the exception that an index is allowed to have duplicates.

One last thing we want to point out before we move on: notice that in the accepted_id column, there seems to be a mix of data: some look like numerical IDs, but others say "NaN". NaN is short for "Not A Number" and is pandas' way of representing *missing data*. Think of NaNs as equivalent to an empty cell in an Excel file. The meaning of missing data depends on the context of the dataset. In this case, since this data is from Stack Overflow and the "accepted_id" column represents the ID of an accepted answer, we can infer that in this case missing data means that the question never received an accepted answer. In research, we often want to do something special to handle missing data; we will return to this later in the workshop.

## 4. Checking the structure of the data
Usually we first do a couple of sanity checks to make sure the data we imported is in good shape and understand its high level structure. 

Usually we make sure the data type of each variable is sensible, check the total number of observations, and the number of variables in the data set.

Let's take a look at the example data set. First, we'll check data types using the `dtypes` variable.

In [7]:
# Check data type of the columns
df.dtypes

id                 int64
creation_time     object
tag               object
year               int64
month              int64
accepted_id      float64
owner_user_id    float64
dtype: object

In [8]:
# Check data type of a specific column
df.accepted_id.dtype

dtype('float64')

Next we'll check the number of observations (rows) in the dataset. This can be done by examining the length of the DataFrame's *index*:

In [9]:
len(df.index)

60570

Similarly, we can check the number of variables (columns) in the dataset by examining the length of the DataFrame's *columns* list:

In [10]:
len(df.columns)

7

## 5. Slicing and Indexing
Usually, we will not be working with an entire data set all at the same time. Instead, we usually want to pick out specific rows or columns to analyze and work with. In pandas, this can be done using *slicing and indexing*.

The most basic indexing operation is selecting a specific column. This can be done using standard Python indexing syntax (square brackets) and giving it the name of the column you want. For example, the following code will select the "id" column:

In [11]:
id_column = df['id']
display(id_column)

0        24752851
1        39926330
2        26762140
3        29889423
4        10582676
           ...
60565    39093361
60566    37248756
60567    16264645
60568    30389191
60569    26181174
Name: id, Length: 60570, dtype: int64

The syntax for selecting a row is similar, except that you need to tell pandas that you are trying to access a row, since indexing defaults to columns. To do this, use the `loc` variable:

In [12]:
fifth_row = df.loc[4] # remember the index starts from 0, so the fifth row is at index 4
display(fifth_row)

id                          10582676
creation_time    2012-05-14 11:43:27
tag                        .htaccess
year                            2012
month                              5
accepted_id                      NaN
owner_user_id              1326187.0
Name: 4, dtype: object

Both row indexing and column indexing allow you to select multiple rows or columns at once. To do this, you can provide a **list** of row indices or column names, instead of just one:

In [13]:
multi_columns = df[['id', 'creation_time']]
display(multi_columns)

             id        creation_time
0      24752851  2014-07-15 07:58:49
1      39926330  2016-10-07 21:55:43
2      26762140  2014-11-05 16:26:24
3      29889423  2015-04-27 07:14:00
4      10582676  2012-05-14 11:43:27
...         ...                  ...
60565  39093361  2016-08-23 05:55:50
60566  37248756  2016-05-16 07:25:11
60567  16264645  2013-04-28 15:50:01
60568  30389191  2015-05-22 05:46:07
60569  26181174  2014-10-03 14:44:59

[60570 rows x 2 columns]

In [14]:
multi_rows = df.loc[[0,1,2,3]]
display(multi_rows)

,id,creation_time,tag,year,month,accepted_id,owner_user_id
0,24752851,2014-07-15 07:58:49,.htaccess,2014,7,24768174.0,509916.0
1,39926330,2016-10-07 21:55:43,.htaccess,2016,10,NaN,5281549.0
2,26762140,2014-11-05 16:26:24,.htaccess,2014,11,26762882.0,2091861.0
3,29889423,2015-04-27 07:14:00,.htaccess,2015,4,NaN,589973.0

Since row indices are numerical, python's **slicing** syntax can also be used on them to select a range of rows. This can simplify your code a lot because you can specify a range rather than writing out full list of indices! For example, the following code is equivalent to the previous code:

In [15]:
multi_rows = df.loc[0:3] # important difference from regular python: pandas slices include *both* indices!
display(multi_rows)

,id,creation_time,tag,year,month,accepted_id,owner_user_id
0,24752851,2014-07-15 07:58:49,.htaccess,2014,7,24768174.0,509916.0
1,39926330,2016-10-07 21:55:43,.htaccess,2016,10,NaN,5281549.0
2,26762140,2014-11-05 16:26:24,.htaccess,2014,11,26762882.0,2091861.0
3,29889423,2015-04-27 07:14:00,.htaccess,2015,4,NaN,589973.0

Additionally, we may sometimes want to pick out a **single** value from the DataFrame. For example, suppose we want to find the question ID in the fifth row. We can do this by giving both a row and column to the `loc` indexer. Note that the row and column **must** be given in that order (you cannot give the column first) and should be separated by a comma, as shown below:

In [16]:
fifth_id = df.loc[4,"id"]
print(fifth_id)

10582676

Finally, the same syntax can be used to select multiple rows **and** columns at the same time; you simply need to provide a list or range of rows, followed by a list of column names, separated by a comma:

In [17]:
multi_row_and_col = df.loc[0:3,["id", "creation_time"]]
display(multi_row_and_col)

         id        creation_time
0  24752851  2014-07-15 07:58:49
1  39926330  2016-10-07 21:55:43
2  26762140  2014-11-05 16:26:24
3  29889423  2015-04-27 07:14:00

## Exercise 1

What is the tag of the 50th question in the data set?

In [18]:
print(df.loc[49,"tag"])

.htaccess

## 6. Summarizing column data
Previously, we sanity checked our data by checking its structure (data types and number of rows and columns). A second common step in preliminary exploration of the data is to examine individual columns (with the help of indexing, as covered previously). pandas can help with this process by offering several methods to *summarize* the data in a column.

### Summarizing numerical data
Some columns contain numerical data. For example, years in the "year" column are represented as numbers. For numerical data, pandas offers a number of methods that implement common mathematical summary functions, such as finding the min and the max:

In [38]:
print(df["year"].min()) # what's the earliest year in the data?
print(df["year"].max()) # what's the latest year in the data?

2008
2020

### Summarizing categorical data
Mathematical operations like min and max are useful for quickly summarizing numerical data. But not all columns are numerical. For example, the "tag" column contains text. But notice that the text in the "text" column is not just any arbitrary text! Rather, it seems to take on specific, repeated values, like ".htaccess" or "zxing". Therefore, "tag" is what data scientists refer to as a *categorical variable*: one that can only take on values from a fixed, finite set of possibilities. To summarize categorical data, researchers generally want to know what is the set of values the variable can take? In pandas, this can be done using the `unique` method:

In [23]:
print(df["tag"].unique())

['.htaccess' '.htpasswd' '.net' ... 'zurb-foundation' 'zurb-foundation-6'
 'zxing']

## Exercise 2

- Which years and months of questions are in the data?

In [24]:
print(df['year'].unique())
print(df['month'].unique())

[2014 2016 2015 2012 2017 2010 2019 2013 2018 2020 2011 2008 2009]
[ 7 10 11  4  5  3 12  2  6  1  8  9]

## 7. Querying using conditions based on column values

Now we can start looking at more advanced data analysis. Previously, we selected subsets of rows by giving the `loc` indexer a list or range of row indices. Most often, however, we don't know ahead of time which rows we want to analyze; instead, we more often want to select rows based on some conditions. For example, we might want all questions that took place in a specific year, or all questions that have a specific tag. To achieve this, the `loc` indexer can actually be used with conditions, not just with indices! 

This is best explained through examples. Let's start with the first example question, looking for all questions that took place in a specific year, let's say 2008. The syntax for the comparison would be `df['year'] == 2008`, and we can pass this comparison directly to `loc`, as follows:

In [25]:
year2008 = df.loc[df['year'] == 2008]
display(year2008)

,id,creation_time,tag,year,month,accepted_id,owner_user_id
92,126868,2008-09-24 12:35:20,.net,2008,9,126910.0,369.0
110,301290,2008-11-19 08:15:01,.net,2008,11,301333.0,35012.0
186,36014,2008-08-30 14:57:13,.net,2008,8,41208.0,3347.0
227,191812,2008-10-10 15:16:30,.net,2008,10,193144.0,11356.0
249,50046,2008-09-08 16:05:17,.net,2008,9,50057.0,770.0
...,...,...,...,...,...,...,...
58981,235700,2008-10-25 00:44:49,winforms,2008,10,235721.0,22437.0
59011,18292,2008-08-20 16:13:39,winscp,2008,8,18370.0,1946.0
59040,160216,2008-10-01 23:25:43,wolfram-mathematica,2008,10,4700704.0,4234.0
59291,377470,2008-12-18 10:28:17,workflow,2008,12,NaN,47349.0
60316,317828,2008-11-25 15:59:31,xslt,2008,11,317839.0,5653.0

Notice that this syntax is similar to the filtering syntax used by numpy (as seen in the previous Python workshop) and by R. Alternatively, if you are familiar with SQL, you can think of the above code as being equivalent to the SQL query `select * from df where year=2008`.

Like in numpy, you can include multiple comparisons in a single query, combining them using operators `&` for "and" and `|` for "or". So, for example, if we wanted only questions from August 2008:

In [26]:
august2008 = df.loc[(df['year']==2008)&(df['month']==8)]
display(august2008)

,id,creation_time,tag,year,month,accepted_id,owner_user_id
186,36014,2008-08-30 14:57:13,.net,2008,8,41208.0,3347.0
385,8142,2008-08-11 19:50:31,.net,2008,8,8152.0,380.0
5888,6719,2008-08-09 09:51:37,asp.net-2.0,2008,8,6720.0,133.0
19152,16233,2008-08-19 14:13:18,fonts,2008,8,16255.0,1000.0
30592,26620,2008-08-25 18:45:27,jquery,2008,8,26681.0,2138.0
33164,1005,2008-08-04 03:34:02,linux,2008,8,37042.0,85.0
33260,263,2008-08-01 23:27:24,linux,2008,8,607.0,61.0
35715,20389,2008-08-21 16:12:45,moss,2008,8,33052.0,1453.0
36128,2056,2008-08-05 10:06:33,mvp,2008,8,101561.0,358.0
45334,4565,2008-08-07 10:20:16,qos,2008,8,NaN,486.0
47327,32941,2008-08-28 18:03:36,reporting-services,2008,8,344461.0,2184.0
53315,16142,2008-08-19 13:22:03,svn,2008,8,16163.0,914.0
59011,18292,2008-08-20 16:13:39,winscp,2008,8,18370.0,1946.0

Notice that when we run a query, the matching rows get returned in a new DataFrame, which is a subset of the original, containing only rows that matched the query. We can confirm that the result is still a DataFrame by checking the type of the variable:

In [27]:
type(august2008)

pandas.core.frame.DataFrame

This means that we can run all of the previously described DataFrame methods on the query results! For example, this can be useful for finding out how many rows matched the query:

In [28]:
print(len(august2008.index)) # we can use the same code we saw earlier for counting rows, because august2008 is still a DataFrame

13

## Exercise 3

How many questions in 2013 had the tag "python"?

In [29]:
python2013 = df.loc[(df['year']==2013)&(df['tag']=='python')]
print(len(python2013.index))

89

## 8. Modifying and adding rows
Queries aren't just useful for accessing data; we may sometimes also want to *modify* data that matches a query! One common reason to do this is for data cleaning. For example, some questions in our data set have the tag ".net" and others have the tag "net", but both of these actually refer to the same thing (the Microsoft dotNET framework). So when we clean the data, we might want to standardize all instances of ".net" to "net". This can be done with the following steps:

1. Write a query to find all instances of the thing you want to clean (in this case, questions with the tag ".net") (See Section 7)
2. Use row-and-column indexing to combine this query (which selects certain rows) with column selection (See Section 5)
3. Use Python assigment syntax (the "=" operator) to set the new value

Again, this is best understood through an example. The following code implements all the steps to standardize ".net" to "net":

In [31]:
# Convert .net to net
df.loc[(df['tag'] == '.net'), 'tag'] = 'net'
# to confirm that it worked, count how many questions are now tagged "net" and how many are tagged ".net" (the latter should be zero)
print(len(df.loc[df['tag'] == 'net'].index))
print(len(df.loc[df['tag'] == '.net'].index))

306
0

In this example, we *replaced* values in an existing column. But there are other cases where instead, you might want to preserve the original data, and instead put the cleaned data in a new column. pandas lets us do this too! As an example, let's recall the missing values in the "accepted_id" column that we told you about earlier. Remember that the interpretation of these missing values is that the question did not receive an accepted answer. For some research questions, we might simply want to know *whether* a question received an accepted answer or not, without caring about the ID of the answer. But this does not mean we want to completely replace the "accepted_id" column, because for *other* research questions we might still care about the answer IDs! So instead, we might want to create a *new* column that contains the simplified information of whether a question received an accepted answer.

We will start by creating a new column, let's call it "has_answer". Initially, we'll create the column as a copy of "accepted_id"; we can then modify it (using code similar to what we did previously for "tag") without affecting the original column. To create a new column, we can simply use Python assigment syntax:

In [35]:
df["has_answer"] = df["accepted_id"]
display(df)

,id,creation_time,tag,year,month,accepted_id,owner_user_id,has_answer
0,24752851,2014-07-15 07:58:49,.htaccess,2014,7,24768174.0,509916.0,24768174.0
1,39926330,2016-10-07 21:55:43,.htaccess,2016,10,NaN,5281549.0,NaN
2,26762140,2014-11-05 16:26:24,.htaccess,2014,11,26762882.0,2091861.0,26762882.0
3,29889423,2015-04-27 07:14:00,.htaccess,2015,4,NaN,589973.0,NaN
4,10582676,2012-05-14 11:43:27,.htaccess,2012,5,NaN,1326187.0,NaN
...,...,...,...,...,...,...,...,...
60565,39093361,2016-08-23 05:55:50,zurb-foundation,2016,8,NaN,2729887.0,NaN
60566,37248756,2016-05-16 07:25:11,zurb-foundation-6,2016,5,37251132.0,1148107.0,37251132.0
60567,16264645,2013-04-28 15:50:01,zxing,2013,4,16264687.0,2102871.0,16264687.0
60568,30389191,2015-05-22 05:46:07,zxing,2015,5,NaN,571433.0,NaN
60569,26181174,2014-10-03 14:44:59,zxing,2014,10,NaN,1491212.0,NaN

We see that there is now a new column "has_answer" that is an exact copy of "accepted_id". Next we will modify it as follows: rows containing missing values will be set to 0 (representing "no answer") and the rest will be set to "1" (representing "has answer").

Syntax notes: to check if a value is missing, pandas provides the special comparison function `isna`. To negate a comparison (so we can say when a row does **not** contain a missing value), we'll use the the `~` operator.

In [37]:
df.loc[~(pd.isna(df['has_answer'])), 'has_answer'] = 1
df.loc[(pd.isna(df['has_answer'])), 'has_answer'] = 0
display(df)

,id,creation_time,tag,year,month,accepted_id,owner_user_id,has_answer
0,24752851,2014-07-15 07:58:49,.htaccess,2014,7,24768174.0,509916.0,1.0
1,39926330,2016-10-07 21:55:43,.htaccess,2016,10,NaN,5281549.0,0.0
2,26762140,2014-11-05 16:26:24,.htaccess,2014,11,26762882.0,2091861.0,1.0
3,29889423,2015-04-27 07:14:00,.htaccess,2015,4,NaN,589973.0,0.0
4,10582676,2012-05-14 11:43:27,.htaccess,2012,5,NaN,1326187.0,0.0
...,...,...,...,...,...,...,...,...
60565,39093361,2016-08-23 05:55:50,zurb-foundation,2016,8,NaN,2729887.0,0.0
60566,37248756,2016-05-16 07:25:11,zurb-foundation-6,2016,5,37251132.0,1148107.0,1.0
60567,16264645,2013-04-28 15:50:01,zxing,2013,4,16264687.0,2102871.0,1.0
60568,30389191,2015-05-22 05:46:07,zxing,2015,5,NaN,571433.0,0.0
60569,26181174,2014-10-03 14:44:59,zxing,2014,10,NaN,1491212.0,0.0

## 9. Fine-grained analysis using groupby
In section 6, we showed how to summarize data from an *entire* column, such as taking the min and max of numerical data. This is useful for initial exploration, but when tackling actual research questions, we often want to do more complicated operations involving interactions between multiple variables. For example, instead of just finding the earliest year in the data, we might be interested in finding the earliest year each tag first appeared. Using what we have learned so far, one way to do this would be to use queries: for each tag, you could write a query to select only the rows containing that tag, and call the `min` method each time. But this is extremely tedious, given that there are so many tags in the data! Thankfully, pandas offers a faster alternative: `groupby`.

The `groupby` method can be thought of a splitting a DataFrame based on some categorical variable. For example, if we use `groupby` on the "tag" column, we'll have one group containing rows tagged ".htaccess", another containing rows tagged "python", and so on, for every unique tag. Now, if we just run `groupby` on its own, we won't immediately see anything useful:

In [41]:
df_grouped = df.groupby("tag")
display(df_grouped) # prints out some strange code that isn't super useful...

But the key difference happens when we call summarization methods on the grouped variable. Instead of running the summarization on the entire data, as happens normally, the summarization will be run separately on each group! Let's try using the `min` summarization method on "year" in the grouped data:

In [44]:
display(df_grouped['year'].min()) # we can use the same indexing and summarization syntax as we did for regular DataFrames, but the operation now happens separately for each group!

tag
.htaccess            2010
.htpasswd            2019
.net-2.0             2011
.net-3.5             2009
.net-4.0             2009
                     ...
zsh                  2013
zshrc                2014
zurb-foundation      2013
zurb-foundation-6    2016
zxing                2013
Name: year, Length: 9033, dtype: int64

As we can see, instead of a single minimum, we get multiple: one for each group! Specifically, we are seeing the earliest year each tag first appeared. We can immediately see how this might be useful for tracking trends; for example, questions tagged ".htaccess" started in 2010, while questions tagged ".htpasswd" didn't start until 2019. This might suggest, for example, that .htpasswd is a newer tag.

There are other kinds of summarization methods that can be useful when combined with `groupby`. Here are just a few examples:

In [48]:
# The count() method counts the total number of unique items in a column.
# When combined with groupby, the counting will happen separately per group.
# Let's try using it to find out how many questions happened per year (by counting the number of unique question IDs per year group)
df_grouped = df.groupby("year")
display(df_grouped["id"].count())

year
2008     141
2009     957
2010    1996
2011    3408
2012    4781
2013    5994
2014    6428
2015    6583
2016    6637
2017    6216
2018    5624
2019    5330
2020    6475
Name: id, dtype: int64

In [49]:
# The sum() method computes the sum of all items in a column
# When combined with groupby, sums are computed separately per group
# Let's try using it to find out how many questions were answered per year.
df_grouped = df.groupby("year")
display(df_grouped["has_answer"].sum())

year
2008     113.0
2009     698.0
2010    1462.0
2011    2358.0
2012    3143.0
2013    3372.0
2014    3436.0
2015    3339.0
2016    3189.0
2017    2874.0
2018    2494.0
2019    2352.0
2020    2314.0
Name: has_answer, dtype: float64

Finally, note that it is possible to group on multiple columns at once! This will create a group for each unique pair of possible values in the two columns. For example, we might be interested not just in years, but in specific year-month combinations:

In [50]:
df_grouped = df.groupby(["year", "month"])
display(df_grouped["id"].count())

year  month
2008  8         13
      9         37
      10        34
      11        26
      12        31
              ...
2020  8        529
      9        555
      10       540
      11       510
      12       106
Name: id, Length: 149, dtype: int64